<template>
  <app-navigation></app-navigation>
  <div class="main-container terms-container" dir="rtl">
    <div class="subtitle preview-font highlight-text">
      <span class="title preview-font primary-text">الشروط و الأحكام</span><br><br>
      <span class="primary-text">مقدمة</span><br>
      هذه الشروط والأحكام القياسية لموقع ب لايت (هذه “الشروط” أو “الشروط والأحكام القياسية لموقع ويب“) الواردة هنا على صفحة ب لايت هذه، تحكم استخدامك لموقع ب لايت هذا، بما في ذلك كافة الصفحات الموجودة على هذا الموقع (المشار إليها هنا بشكل جماعي أدناه باسم “موقع ويب” هذا). تنطبق هذه الشروط بكامل سريانها وتطبيقها على استخدامك لموقع الويب هذا وباستخدام موقع الويب هذا، أنت توافق صراحةً على جميع البنود والشروط الواردة في هذا المستند بالكامل. يجب ألا تستخدم هذا الموقع الإلكتروني، إذا كان لديك أي اعتراض على أي من البنود والشروط القياسية لموقع الويب هذا. موقع ويب هذا ليس للاستخدام من قبل أي قاصر (يعرف بأنه هؤلاء الذين لا تقل أعمارهم عن 18 سنة)، ويجب عليك عدم استخدام موقع ويب هذا إذا كنت قاصراً. حقوق الملكية الفكرية غير المحتوى الذي تملكها، والذي يمكنك القيام به<br><br><br>
      <span class="primary-text">حقوق الملكية الفكرية</span><br>
      بخلاف المحتوى الذي تملكها، والذي قد تكون اخترت تضمينه على موقع ويب هذا، بموجب هذه الشروط، و/أو مرخصوها كل الحقوق المتعلقة بالملكية الفكرية والمواد المضمنة في موقع ويب هذا، ويتم الاحتفاظ بجميع هذه الحقوق. يتم منحك ترخيصًا محدودًا فقط، وفقًا للقيود المنصوص عليها في هذه الشروط، بغرض عرض المواد الموجودة على موقع الويب هذا
      إنك مقيّد بشكل صريح وقاطع على كل ما يلي:<br>
      <ul>
        <li>نشر أي مواد على موقع ويب في أي وسائط؛</li>
        <li>بيع و/أو منح ترخيص فرعي و/أو تسويق أي مادة من مواد موقع ويب؛</li>
        <li>أداء و/أو عرض أي مواد لموقع الويب بشكل عام؛</li>
        <li>استخدام موقع ويب هذا بأي طريقة تكون ضارة بموقع ويب هذا أو قد تلحق الضرر به؛</li>
        <li>ستخدام موقع الويب هذا بأي طريقة تؤثر على وصول المستخدم إلى موقع الويب هذا؛</li>
        <li>استخدام موقع ويب هذا بما يتعارض مع القوانين واللوائح المعمول بها، أو بطريقة تسبب أو قد تتسبب في إلحاق ضرر بموقع ويب أو بأي شخص أو كيان تجاري؛</li>
        <li>المشاركة في أي تعدين للبيانات أو جمع البيانات أو استخراج البيانات أو أي نشاط مماثل آخر فيما يتعلق بموقع الويب هذا، أو أثناء استخدام موقع الويب هذا؛</li>
        <li>استخدام هذا الموقع للمشاركة في أي إعلان أو تسويق؛</li>
      </ul><br>
      <span class="primary-text">المحتوى الخاص بك</span><br>
      في هذه الشروط والأحكام القياسية لموقع ب لايت، يعني “المحتوى الخاص بك” أي صوت أو فيديو أو نص أو صور أو أي مواد أخرى تختار عرضها على موقع ب لايت هذا. فيما يتعلق بالمحتوى الخاص بك، من خلال عرضه، فإنك تمنح ترخيصًا غير حصري وعالماً وغير قابل للإلغاء وغير قابل للترخيص من قبل الملكية وغير قابل للترخيص من الباطن لاستخدامه وإعادة إنتاجه وتكييفه ونشره وترجمته وتوزيعه في أي وكل الوسائط. يجب أن يكون المحتوى الخاص بك هو المحتوى الخاص بك ويجب ألا ينتهك حقوق أي طرف ثالث. يحتفظ موقع بالحق في إزالة أي محتوى من موقع ويب هذا في أي وقت ولأي سبب من الأسباب، من دون إشعار.<br><br>
      <span class="primary-text">لا توجد ضمانات</span><br>
      يتم توفير موقع الويب هذا “كما هو“، مع كل الأخطاء، و لا يقدم أي تعهدات أو ضمانات صريحة أو ضمنية، من أي نوع ذي صلة بموقع الويب هذا أو المواد الموجودة على موقع الويب هذا. بالإضافة إلى ذلك، لن يتم تفسير أي شيء موجود على موقع ويب هذا على أنه يوفر لك المشورة أو المشورة.<br><br>
      <span class="primary-text">تحديد المسؤولية</span><br>
      لا تتحمل ، ولا أي من مسؤوليها ومديريها وموظفيها، بأي حال من الأحوال المسؤولية تجاهك عن أي شيء ينشأ عن استخدامك لموقع الويب هذا أو يرتبط به بأي شكل من الأشكال، سواء كانت هذه المسؤولية بموجب عقد أو ضرر أو غير ذلك، ، بما في ذلك مسؤوليه ومديروها وموظفوها، لن يكونوا مسؤولين عن أي مسؤولية غير مباشرة أو تبعية أو خاصة تنشأ عن استخدامك لهذا الموقع الإلكتروني أو ترتبط به بأي شكل من الأشكال. التعويض إنك تقوم بموجب هذا بالتعويض إلى أقصى حد من جميع الالتزامات والتكاليف والمطالب وأسباب الدعوى والأضرار والمصروفات (بما في ذلك أتعاب المحاماة المعقولة) الناشئة عن انتهاكك لأي من أحكام هذه الشروط أو بأي شكل من الأشكال.
    </div>
  </div>
</template>

<style scoped>
  .terms-container {
    padding: 50px 0;
    text-align: right;
  }
</style>

<script>
import AppNavigation from "@/Components/AppNavigation.vue"

export default {
  components: {
    AppNavigation
  }  
}
</script>